# برنامه‌ی شمردن اتاق‌های هتل hotel-rooms-1
# را توسعه دهید.
# این بار فرض می‌کنیم که تعداد
# اتاق‌های هر ردیف ممکن است متفاوت از
# ردیف دیگر باشد. فرض کنید اتاق
#‌های هر ردیف به هم چسبیده هستند.
#
# input:
# +--+--+--+--+--+
# |  |  |  |  |  |
# +--+--+--+--+--+
# |  |  |  |  |
# +--+--+--+--+
#    |  |  |
#    +--+--+
# +
# output:
# 11
# input:
# +--+--+--+--+--+
# |  |  |  |  |  |
# +--+--+--+--+--+
# |  |  |  |  |  |
# +--+--+--+--+--+
# +

# output:
# 10
tedad = 0
n=0
while (n != '*'):
    n = raw_input('')
    c=n.count('|  ')
    if c != 1 and c != 0:
        tedad+=c
        print tedad
        if (n.count('|') == c):
            tedad-=1
            print (tedad)
        print tedad    
    #    print n[:]#+n[3:]
    

